from pyrogram.emoji import *

class TEXT:
    DOWNLOAD_START = f"ഡോൺലോഡ് തുടങ്ങി മക്കളെ  {INBOX_TRAY}"
    UPLOAD_START = f"അപ്‌ലോഡ് തുടങ്ങി മക്കളെ {OUTBOX_TRAY}"
    UPLOAD_SUCESS = f"ഉപയോഗിച്ചതിനു നന്ദി {FOLDED_HANDS} By [Movies_Club_2019](https://t.me/Movies_Club_2019)"
    BANNED_USER_TEXT = f"Hey bro,നിനക്ക് ഞാൻ **ban** തന്നു ഇനി ഈ വഴിക്ക് വരരുത് {SMIRKING_FACE}."
    NOT_LOGGED_TEXT = f"This bot was only for private use {LOCKED_WITH_KEY}. If you want to use this bot you need to send me correct password in the format `/login bot_password`"
    SAVED_CUSTOM_THUMBNAIL = f"Thumbnail സേവ് ആക്കിട്ടുണ്ട്  {CAMERA_WITH_FLASH}"
    DELETED_CUSTOM_THUMBNAIL = f"Thumbnail ഡിലീറ്റ് ആക്കിട്ടുണ്ട്  {BROKEN_HEART}"
    NO_CUSTOM_THUMB_NAIL_FOUND = f"ഒരു TB ലും ഇല്ലടെയ് വേറെ സാധനം വിട് {THUMBS_DOWN_LIGHT_SKIN_TONE}"
    THUMBNAIL_CAPTION = f"{BACKHAND_INDEX_POINTING_UP_LIGHT_SKIN_TONE} നിങ്ങൾ തന്ന TB"


    ABOUT = """**അമ്പടി ജിന്ജിന്നക്കിടി😎:**
**😁എന്തിനാ മോനെ ഇത്രേം സാഹസം കാണിച്ചത് 📃Source Code📃 ന് വേണ്ടിയാണോ🙄ന്തയാലും ഇവിടെ വരെ വന്നില്ലേ🤔 ചാനലിലും ഗ്രൂപ്പിലുമൊക്കെ ജോയിൻ😛 ചെയ്തിട്ട് പൊക്കോ🚶🤧**
"""

HELP_USER = """**👇താഴെ എഴുതിയേക്കുന്നെ നല്ലോണം വായിച്ചു നോക്ക്**👍.
   
👉 **Use /mode command to change upload മോഡ് VIDEO🎥 Or FILE📁**.
👉 **ഒരു ഫോട്ടോ സെന്റ് ചെയ്താൽ Thumbnail ആക്കാം**✅️.
👉 **അത് കഴിഞ്ഞു ഫയൽ ഇങ്ങോട്ട് വിട് നൻബാ**🖊️.
👉 **അത് കഴിഞ്ഞു പുതിയ നെയിം ഇങ്ങോട്ട് ഇട്ടേരെ. ബാക്കി ഞാൻ ഏറ്റു**😎..

@Movies_Club_2019"""



     START_TEXT = """Hi {user_mention},
I am a telegram renamer with permanent thumbnail.
𝖥𝗈𝗋 𝖬𝗈𝗋𝖾 𝖣𝖾𝗍𝖺𝗂𝗅𝗌 𝖲𝖾𝖾 𝖧𝖾𝗅𝗉.
**Maintained By:** {bot_owner}
"""


    DONATE_USER = """**Donation തരണമെന്ന് ചിന്തിച്ച ആ മനസ്സ് ഞാൻ കാണുന്നു💗.
 
ഇതിലൊക്കെ ഉണ്ട് ഞാൻ:
 
GooglePay / Paytm / PhonPay / Paypal.
 
**For Donate: message me On Telegram** 👉**@Myfreak123**"""
